# GetObjectData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModificationOutsideTransactionException..::..GetObjectData Method
ModificationOutsideTransactionException Class See Also
---
Retrieves data needed to serialize the target object.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

Visual Basic
---
```text
Public Overrides Sub GetObjectData ( _
	info As SerializationInfo, _
	context As StreamingContext _
)
```

Visual C++
---
```text
public:
virtual void GetObjectData(
	SerializationInfo^ info,
	StreamingContext context
) override
```

# ### Parameters
info
    Type: System.Runtime.Serialization..::..SerializationInfo Data needed to serialize or deserialize the object.
context
    Type: System.Runtime.Serialization..::..StreamingContext The destination of the serialized stream.
# ### Implements
ISerializable..::..GetObjectData(SerializationInfo, StreamingContext)_Exception..::..GetObjectData(SerializationInfo, StreamingContext)
# See Also
ModificationOutsideTransactionException Class
Autodesk.Revit.Exceptions Namespace